{
    "Christmas Crib": "The 'Christmas Crib' portrays the Nativity scene, which represents the birth of Jesus Christ in a humble manger in Bethlehem. Traditionally, it includes the figures of Mary, Joseph, and baby Jesus Luke in his Gospel also refers to other characters from the Nativity story, such as shepherds, sheep, and angels, which aree displayed near the manger in a stable (or cave) intended to accommodate farm animals. Other animals which are typically included in the scene are the donkey and a cow. Matthew in his Gospel also recalls the adoration of baby Jesus by the Magi, who arrived at the scene with their camels offering gifts to the Lord. The lighting Star of Bethlehem is predominant in most cribs, signfying the signal and the light that is associated with the Birth of Jesus. The universal significance of the crib is traceable to various cultures, most of whom opt to introduce other characters and objects that may not be biblical but reflect their customs or traditions. The first living Nativity scene, attributed to Saint Francis of Assisi, was created in 1223 in the Italian town of Greccio. Francis had been inspired by his visit to the Holy Land, when he paid a visit to Jesus's traditional birthplace. The crib symbolizes the simplicity and holiness of Christ’s birth, serving as a focal point for reflection and celebration during Christmas. It conveys a message of love, peace, and humility.\n\nIl-'Presepju tal-Milied' juri x-xena tat-Twelid, li tirrappreżenta t-twelid ta' Ġesù Kristu f'maxtura f'Betlehem. Tradizzjonalment, il-presepju jinkludi figuri ta’ Marija, Ġużeppi, u il-Bambin Ġesù. Karattri oħra mill-istorja tat-Twelid hekk kif deskritti fl-Evanġelju ta’ Luqa huma r- rgħajja, xi nagħaġ, u l-anġli. Dawn generalment  jintwerew qrib il-maxtura f-istalla (jew għar),post fejn kienu jinżammu l-annimali tar-raba’. Annimali oħra li tipikament jiġu inklużi fix-xena, huma il-ħmar u l-baqra. Mattew, fl-Evanġelju tiegħu, ifakkar ukoll l-adorazzjoni tal-Bambin Ġesù mill-Maġi, li waslu fix-xena bl-iġmla tagħhom, biex joffru rigali lit-Tarbija Ċkejkna ta’ Ġesu’. Il-Kewkba ta’ Betlehem hija predominanti f’ħafna presepji, hekk kif tissimbolizza is-sinjal mibghut mis-sema, u d-dawl assoċjati mat-Twelid ta’ Ġesù. Is-sinifikat universali tal-presepju huwa traċċabbli għal diversi kulturi, li ħafna minnhom jagħżlu li jżidu karattri u oġġetti oħra li mhux bilfors huma  bibliċi imma jirriflettu d-drawwiet jew it-tradizzjonijiet ta’ dawn il-kulturi. L-ewwel presepju ħaj, kien tħejja minn San Franġisk t’Assisi, fl-1223 fil-belt Taljana ta’ Greccio. Franġisku kien ispirat miż-żjara tiegħu fl-Art Imqaddsa, fejn kien żar il-post fejn kien twelid Ġesù. Il-presepju jissimbolizza s-sempliċità u l-qdusija tat-twelid ta’ Kristu, u jservi bħala punt ta’ riflessjoni u ċelebrazzjoni matul il-Milied, filwaqt li jwassal messaġġ ta’ mħabba, paċi, u umiltà.",
    "Jesus has Risen": "The 'Jesus Has Risen' recounts Jesus Christ's resurrection on the third day after His crucifixion. Women visiting His tomb found it empty, and they encountered an angel who announced that He has risen. Jesus appears to Mary Magdalene, His disciples, and others, confirming His victory over death and fulfilling prophecies. This event signifies hope, renewal, and eternal life for believers, stressing the foundation of Christian faith and the celebration of Easter. Matthew clearl recalls this scene by the following text in his gospel 'And the angel answered and said unto the women, Fear not ye; for I know that ye seek Jesus, who hath been crucified. He is not here; for he is risen, even as he said. Come, see the place where the Lord lay. And go quickly, and tell his disciples, He is risen from the dead; and lo, he goeth before you into Galilee; there shall ye see him: lo, I have told you.' (Matthew 28:5-7) The resurrection of Jesus Christ is the cornerstone of the Christian faith. Without the resurrection, the belief in God's saving grace and mercy through Jesus would be void. When Jesus rose from the dead, He proved His divinity as the Son of God and affirmed His works of atonement, redemption, reconciliation, and salvation. The resurrection was a real, physical raising of Jesus’ body from the dead.\n\n'L-Irxoxt' jissimbolizza  l-qawmien ta’ Ġesù Kristu fit-tielet jum wara l-passjoni u l-mewt tiegħu. In-nisa li żaru l-qabar tiegħu sabuh vojt, u anġlu ħabbrilhom li Ġesu’ kien qam. Ġesù deher lil Marija Madalena, lid-dixxipli tiegħu, u lil oħrajn. Dawn id-dehriet jikkonferma r-rebħa tiegħu fuq il-mewt u il-profeziji msemmija fit Testment il-Qadim. Dan l-avveniment jissimbolizza t-tama, it-tiġdid, u l-ħajja ta’ dejjem għall-fidili, u jenfasizza l-pedament tal-fidi Nisranija u ċ-ċelebrazzjoni tal-Għid. Mattew ifakkar b’mod ċar din ix-xena fl-Evanġelju tiegħu: ‘U l-anġlu wieġeb u qal lin-nisa, ‘Tibżgħux intom; għax naf li qed tfittxu lil Ġesù, li kien imsallab. Mhuwiex hawn, għax qam. Ejjew, araw il-post fejn kien imqiegħed il-Mulej. U morru malajr, għidu lid-dixxipli tiegħu, ‘Tibżgħu xejn intom għax jiena naf li qegħdin tfittxu lil Ġesù li kien imsallab. Mhuwiex hawn, għaliex qam, kif kien qal. Ejjew araw il-post fejn kien qiegħed. U morru malajr għidu lid-dixxipli tiegħu li hu qam mill-imwiet. U araw, huwa sejjer il-Galilija qabilkom: tarawh hemmhekk.' (Mattew 28:5-7) Il-Qawmien ta’ Ġesù Kristu mill-imwiet huwa l-pedament tal-fidi Nisranija. Mingħajr il-Qawmien mill-imwiet, it-twemmin fil-grazzja u l-ħniena tas-salvazzjoni t’Alla permezz ta’ Ġesù ma kienx isseħħ. Meta Ġesù qam mill-imwiet, Huwa wera d-divinità tiegħu bħala l-Iben t’Alla u kkonferma l-opri tiegħu ta’ tpattija, fidwa, rikonċiljazzjoni, u salvazzjoni. Il-Qawmien mill-imwiet kien qawmien reali u fiżiku tal-ġisem ta’ Ġesù mill-imwiet.",
    "Jesus praying in Gethsemane": "The 'Jesus Praying in Gethsemane' scene occurs after the Last Supper. Jesus retreats to the Garden of Gethsemane with His disciples to pray. Overwhelmed by the weight of His impending crucifixion, He pleads with God to let the cup of suffering pass from Him but submits to God's will. Jesus went with His disciples to a place called Gethsemane and asked them to keep watch while He prayed. Throwing Himself face downward on the ground, He prayed, 'My Father, if it is possible, take this cup of suffering from me! Yet not what I want, but what you want.' He found the disciples asleep and asked them to keep watch. Then He prayed again, 'My Father, if this cup of suffering cannot be taken away unless I drink it, your will be done.' He found the disciples asleep again, left them, and prayed a third time. Then He returned and woke them, saying, 'Get up, let us go. Look, here is the man who is betraying me!' This moment reflects Jesus' humanity and divine mission, highlighting His obedience and deep sorrow.\n\nIx-xena ta’ 'Ġesù fl-Ort tal-Ġetsemani' sseħħ wara l-Aħħar Ċena. Ġesù mar lura fil-Ġnien tal-Ġetsemani mad-dixxipli tiegħu biex jitlob. Maħkum mill-piż u tas-salib li kien ġej, Ġesù talab lil Alla biex jeħilsu mill-kalċi tas-sofferenza, iżda xorta waħda ssottometta ruħu għar-rieda ta’ Alla. Ġesù mar mad-dixxipli tiegħu f’post imsejjaħ Ġetsemani u talabhom biex jibqgħu mqajmin waqt li hu jitlob. Ġesù nxteħet wiċċu ’l isfel mal-art u talab, ‘Missier, jekk hu possibbli, neħħili dan il-kalċi tas-sofferenza! Imma mhux kif irrid jien, iżda kif trid Int.’Meta sab lid-dixxipli rieqda, talabhom biex jibqgħu mqajmin. Imbagħad talab mill-ġdid, 'Missier, jekk dan il-kalċi ma jistax jgħaddi jekk ma nixrobhx, ħa tkun ir-rieda tiegħek.' Reġa' sab lid-dixxipli rieqda, ħalliehom u talab għat-tielet darba. Wara dan, irritorna u qajjimhom, u qal, 'Qumu, ejjew immorru. Araw, dak li se jittradini wasal!' Dan il-mument jirrifletti l-umanità u l-missjoni divina ta’ Ġesù, u jenfasizza l-ubbidjenza u l-uġigħ profond tiegħu.",
    "Our Lady of Grace": "The 'Our Lady of Grace' devotion honors the Virgin Mary, who is venerated for her grace, compassion, and intercession. This title, originating in the 12th century, is associated with Mary's role as the bearer of divine grace, as highlighted in the Gospel of Luke when the Angel Gabriel greets her as 'full of grace.' Statues of Our Lady of Grace often depict her with outstretched arms, symbolizing her readiness to embrace and share divine grace with all, and in some representations, she holds the infant Jesus, signifying her role as the mother of Christ and her mission to bring Him to the world. Devotees pray to Our Lady of Grace to seek comfort, blessings, and intercession. Trusting in her as a spiritual mother who offers solace and divine grace. In Malta, statues of Our Lady of Grace can be found in the chapel of Ħaż-Żebbuġ and the parish church of Ħaż-Żabbar. She is deeply venerated in these places, serving as a focal point for prayer and reflection, inspiring faith and trust in her compassionate presence.\n\nIl-Madonna tal-Grazzja hija devozzjoni li tonora lill-Verġni Marija, li hija venerata għall-grazzja, il-ħniena, u l-interċessjoni tagħha. Dan it-titlu, li joriġina mis-seklu 12, huwa marbut mar-rwol ta’ Marija bħala Portatura tal-grazzja divina, kif muri fl-Evanġelju ta’ San Luqa meta l-Anġlu Gabrijel jindirizzaha bħala 'mimlija bil-grazzja.' L-istatwi tal-Madonna tal-Grazzja ħafna drabi juruha b’dirgħajha miftuħa, li jissimbolizzaw ir-rieda tagħha li tgħannaq u taqsam il-grazzja divina. F’xi rappreżentazzjonijiet Hija tidher iżżomm lil Ġesù tarbija, li jfisser ir-rwol tagħha bħala omm Kristu u l-missjoni tagħha li ġġibhu fid-dinja. Id-devoti jitolbu lill-Madonna tal-Grazzja biex jiksbu faraġ, il-barka, u interċessjoni, billi jafdaw fiha bħala omm spiritwali li toffri kenn u grazzja divina. F’Malta, statwi tal-Madonna tal-Grazzja jistgħu jinstabu fil-kappella ta’ Ħaż-Żebbuġ u fil-knisja parrokkjali ta’ Ħaż-Żabbar. F’dawn il-postijiet hija maħbuba ħafna, u sservi bħala punt ta’ talb u riflessjoni, tispira fidi u fiduċja fil-preżenza ħanina tagħha.",
    "Saint Joseph": "Saint Joseph, the earthly father of Jesus and husband of the Virgin Mary, is revered for his righteousness, humility, and devotion. He is honored as the patron saint of families, workers, and the Universal Church. In Malta, his veneration is evident through various statues across the islands. Notably, the Għajnsielem Parish Church houses a statue of Saint Joseph, acquired from Gallard et Fils in Marseilles in 1910. In Kalkara, the titular statue of Saint Joseph, crafted by Ferdinando Stuflesser in 1948, was recently restored to mark its 75th anniversary. Valletta's Basilica of Our Lady of Mount Carmel features one of the oldest statues, depicting Saint Joseph with the child Jesus, celebrating its 325th anniversary in 2019. Additionally, other statues of Saint Joseph can be found in the churches of Ħaż-Żebbuġ and Msida. These statues reflect on St Joseph importance as a spiritual father and role model. These statues serve as a focal point for prayer and reflection, inspiring believers to live lives of faith and service.\n\nSan Ġużepp, il-missier putattiv ta’ Ġesù u r-raġel tal-Verġni Marija, huwa meqjum għall-ġustizzja, l-umiltà, u d-devozzjoni tiegħu. Huwa meqjus bħala l-patrun tal-familji, tal-ħaddiema, u tal-Knisja Universali. F'Malta, id-devozzjoni lejh tidher b'mod ċar permezz ta' diversi statwi madwar il-gżejjer. B'mod partikolari, il-Knisja Parrokkjali ta' Għajnsielem fiha statwa ta' San Ġużepp, miksuba mingħand Gallard et Fils f'Marsilja fl-1910. Fil-Kalkara, l-istatwa titulari ta' San Ġużepp, maħduma minn Ferdinando Stuflesser fl-1948, ġiet restawrata reċentement biex tfakkar il-75 anniversarju tagħha. Il-Bażilika tal-Madonna tal-Karmnu fil-Belt Valletta fiha waħda mill-eqdem statwi, li turi lil San Ġużepp mat-tfajjel  Ġesù,liema statwa għalqet il-325 anniversarju tagħha fl-2019. Barra minn hekk, l-istatwi oħra ta' San Ġużepp jinsabu fil-knejjes ta' Ħaż-Żebbuġ u tal-Msida. Dawn l-istatwii jirriflettu l-importanza ta’ San Ġuzepp bħala missier spiritwali u mudell ta' ħajja tajba. Dawn l-istatwi jservu bħala punt ċentrali ta' talb u riflessjoni, u jispiraw lill-fidili biex jgħixu ħajja ta' fidi u servizz.",
    "Saint Philip of Agira": "Saint Philip of Agira was one of the first exorcists and Christian preachers, and he is known for the important role he played in proclaiming the Christian Faith in the early centuries of Christianity. Born in Antioch, he traveled to Sicily, where he spread Christianity and converted many to the faith. His mission was focused on spreading the Gospel and overcoming evil, often depicted in religious art performing exorcisms. Saint Philip is celebrated for his dedication to the teachings of Christ, and he is considered a symbol of the triumph of good over evil. His relics, which include his remains, are venerated by many. The parish church in Agira, Sicily, dedicated to Saint Philip, stands as a testament to his spiritual legacy. It houses a silver bust of the saint, commemorating his life and works. This church is an important pilgrimage site for the faithful, drawing visitors who honor Saint Philip's devotion and seek inspiration. Similarly, the Parish Church of St. Philip in Ħaż-Żebbuġ celebrates the liturgical feast of Saint Philip on the 12th of May. The church houses a remarkable full silver statue of Saint Philip, designed by Luigi Fontana, making it unique in all of Malta. This statue, which has been in the church for over 150 years, is one of the most prized treasures of the parish. Additionally, the church holds a relic from Saint Philip’s palm, which has been preserved for over 300 years. This relic is used in the annual procession and adoration during June, a tradition that continues to this day.\n\nSan Filep ta’ Aġġira kien wieħed mill-ewwel eżorċisti u predikaturi Nisranin, u huwa magħruf għar-rwol importanti li kellu fil-proklamazzjoni tal-Fidi Nisranija fl-ewwel sekli tal-Kristjaneżmu. Imwieled f’Antjokja, Filep evangelizza lil Sqallija, u kkonverta lil ħafna għall-Kristjaneżmu. Il-missjoni tiegħu kienet it-tixrid ta’ l-Evanġelju u l-għeleb tal-ħażen. Ħafna drabi jidher fl-arti reliġjua jeżorċizza x-xjaten. San Filep huwa mfakkar għall-impenji tiegħu lejn it-tagħlim ta’ Kristu, u huwa meqjum bħala simbolu tal-trijonf tat-tajjeb fuq il-ħażin.  Il-relikwji tiegħu, li jinkludu l-fdalijiet minn tiegħu, huma maqjuma minn ħafna. Il-knisja parrokkjali ta’ Agira, Sqallija, dedikata lil San Filep, ġiet mwaqqfai bħala t-testimonjanża tar-rieda spiritwali tiegħu. Fiha jinsab il-bust tal-fidda tal-qaddis, li jfakkar il-ħajja u l-opri tiegħu. Din il-knisja hija post ta' pellegrinaġġ importanti għall-fidili, li jattira viżitaturi li juru r-rispett għall-impenji ta' San Filep u jfittxu ispirazzjoni mill-eżempju tiegħu. Simli, f’ Malta, Il-Knisja Arċipretali ta’ San Filippu f’Ħaż-Żebbuġ tiċċelebra l-festa liturġika ta’ San Filippu fit-12 ta’ Mejju. Il-knisja fiha statwa unika ta’ San Filippu magħmula mill-fidda pur, iddisinjata minn Luigi Fontana, l-unika waħda f’Malta.Barra minn hekk, il-knisja għandha reliqwa ta’ l-irkoppa ta’ San Filep, li ilha fil-parroċċa għal aktar minn 300 sena. Din ir-relikwija tintuża fil-proċessjon u l-adorazzjoni annwali fil-ġunju, tradizzjoni li tkompli sal-lum.",
    "Simon of Cyrene": "Simon of Cyrene was compelled to help Jesus carry His cross on the way to Calvary. This act, though forced, became a symbol of discipleship, compassion, and sharing in Christ's suffering. Simon’s inclusion in the Passion narrative shows the importance of serving others and bearing one another's burdens. His role in the story of the Passion teaches believers that true discipleship involves selfless service and solidarity with those who suffer. The act of Simon carrying the cross also serves as a reminder of how Jesus, in His suffering, invited others to participate in His redemptive work. Over time, Simon of Cyrene became a symbol of empathy and the willingness to share in Christ’s passion for the sake of others. His example is an inspiration for Christians to respond to the call to help and bear each other’s burdens, especially during times of hardship.\n\nXmun minn Ċireni ġie mġiegħel jgħin lil Ġesù jerfa’ s-salib fit-triq lejn il-Kalvarju. Dan l-att, għalkemm imġiegħel, jissimobliżża id-dixxiplina, kompassjoni, u qsim fit-tbatija ta’ Kristu. Il-karattur ta’ Xmun fil-Passjoni nfakkar fl-importanza li ngħinu lil xulxin  u nkunu ta’ servizz u solidarjeta’ għal xulxin. Ir-rwol tiegħu fl-istorja tal-Passjoni jgħallem lill-fidili li d-dixxipulat vera jinvolvi servizz mingħajr egoiżmu u s-solidarjetà ma’ dawk li jbatu. L-azzjoni ta' Xmun li jġorr il-kruċifiss tfakkarna kif Ġesù, jistieden lill-bnedmin biex jipparteċipaw fil-ħidma ta’ rivelazzjoni tiegħu. Matul iż-żmien, Xmun minn Ċireni sar simbolu ta' empatija u l-volontarjetà li jgħin fl-imħabba tal-passjoni ta' Kristu għall-benefiċċju tal-oħrajn. Bl-eżempju tiegħu huwa inspirazzjoni għall-Kristjani biex jirrispondu għall-istedina biex jgħinu li ħadd ieħor biex iġor is-salib, speċjalment fil-perjodi ta' diffikultà.",
    "The Betrayal of Judas": "The ‘Betrayal of Judas’ recounts Judas Iscariot’s betrayal of Jesus to the authorities for thirty pieces of silver. Judas identifies Jesus with a kiss in Gethsemane, leading to His arrest. This act represents on one hand the greed, treachery, and the fulfilment of prophecy, which contrast strongly with Jesus' forgiveness and sacrifice. Judas' actions fulfilled prophet Zechariah’s words in the Old Testament, when he foretold that a leader will be betrayed for the price of thirty silver coins. This betrayal was a pivotal moment in the Passion narrative, as it set the stage for Jesus' arrest, trial, and eventual crucifixion. Judas' role in this event is seen as a tragic one, highlighting the destructive power of greed and disloyalty. Despite his actions, Jesus offered forgiveness, demonstrating the boundless love and mercy of God, even for those who turn against Him. Judas’ betrayal is often interpreted as a necessary part of God’s redemptive plan, but it also serves as a warning to believers about the dangers of sin and the consequences of betraying one’s faith.\n\n‘It-Tradiment ta’ Ġuda’ jirrakkonta kif Ġuda Iskarjota tradixxa lil Ġesù mal-awtoritajiet għal tletin biċċa tal-fidda. Ġuda identifika lil Ġesù b’bewsa f’Ġetsemani, u b’hekk wassal għall-arrest Tiegħu. Dan l-att jirrappreżenta, minn naħa waħda, il-kilba għall-flus, it-tradiment u l-miġja tal-profezija, li jikkuntrastaw bil-qawwa mal-maħfra u s-sagrifiċċju ta’ Ġesù.B’azzjonijiet ta’ Ġuda wettqu kliem il-profeta Żakkarija fl-Antik Testment, meta kien ħabbar li mexxej kien se jiġi tradut għall-prezz ta’ tletin biċċa tal-fidda. Dan it-tradiment kien mument kruċjali fir-rakkont tal-Passjoni, għax ipprepara t-triq għall-arrest, il-proċess, u il-fatt li Ġesù kien ser jiġi msallab fuq salib.Ir-rwol ta’ Ġuda f’dan l-avveniment huwa meqjus bħala wieħed traġiku, li jenfasizza s-setgħa distruttiva tal-gwadan u n-nuqqas ta’ lealtà. Minkejja dak li għamel, Ġesù xorta offra l-maħfra, u b’hekk wera l-imħabba u l-ħniena bla tarf ta’ Alla, anki għal dawk li jittraduh. It-tradiment ta’ Ġuda spiss jiġi interpretat bħala parti essenzjali mill-pjan ta’ fidi u fidwa ta’ Alla, iżda fl-istess ħin iservi ta’ twissija lill-fidili dwar il-perikli tad-dnub u l-konsegwenzi li ġġib magħha t-tradiment tal-fidi.",
    "The Cross": "The Cross symbolises Jesus' crucifixion and His ultimate sacrifice for humanity's redemption. It represents suffering, forgiveness, and victory over sin. Christians venerate the Cross as a sign of salvation, reflecting on the love and grace of Jesus’ sacrifice to reconcile humanity with God. The Cross is central to Christian faith, as it symbolizes God’s immense love for mankind. Through Jesus’ suffering and death, believers are granted the opportunity for eternal life, with the Cross becoming a powerful symbol of hope, faith, and transformation. It serves as a reminder of the selfless love that Jesus demonstrated through His ultimate sacrifice. Besides the Cross, early Christians also adopted the symbolism of a fish, which in Greek was called ‘Ichthys’. This symbol was used by early Christians to secretly express their faith during times of persecution. The fish represented Jesus Christ, Son of God, and Savior, with each letter of the Greek word ‘Ichthys’ serving as an acronym for the phrase ‘Jesus Christ, God's Son, Savior’. \n\nIs-Salib jissimbolizza l-kruċifissjoni ta’ Ġesù u s-sagrifiċċju finali tiegħu għall-iskop tal-fidwa tal-umanità. Jirrappreżenta sofferenza, maħfra, u rebħa fuq id-dnub. Il-Kristjani jqimu lis-Salib bħala sinjal tas-salvazzjoni, jirriflettu dwar l-imħabba u l-grazzja tas-sagrifiċċju ta’ Ġesù biex jirrikonċilja l-umanità ma’ Alla. Is-Salib huwa ċentrali fil-fidi Kristjana, peress li jirrappreżenta l-mument tal-imħabba enormi ta’ Alla għall-bniedem. Permezz tas-sofferenza u l-mewt ta’ Ġesù, il-fidili għandhom iċ-ċans għal ħajja eterna. Is-simbolu tas-Salib jirrappreżenta il-qawwa ta’ tama, fidi, u trasformazzjoni. Is -Salib jservi wkoll bħala tifkira tal-imħabba bla kundizzjonijiet li wera Ġesù meta ssallab għall-bnedmin.Minbarra l-Kruċifiss, l-ewwel Kristjani adottaw ukoll is-simbolu ta’ ħuta, li fil-Grieg kienet tissejjaħ ‘Ichthys’. Dan is-simbolu kien użat minn dawn il-Kristjani biex jesprimu l-fidi tagħhom b’mod sigriet matul żminijiet ta’ persekuzzjoni. Il-ħuta tirrappreżenta lil Ġesù Kristu, Iben ta' Alla, u Salvatur, b’kull ittra tal-kelma Griega ‘Ichthys’ li sserva bħala akronimu għall-frażi ‘Ġesù Kristu, Iben ta’ Alla, Salvatur’.",
    "The Crucifixion": "The 'Crucifixion' describes Jesus' execution at Golgotha. Nailed to the Cross, He endures physical agony and mockery from onlookers. Despite His suffering, Jesus offers forgiveness to His persecutors and entrusts His spirit to God. As He hangs on the Cross, He speaks His final words: 'Father, forgive them, for they do not know what they are doing' and 'It is finished'. These words signify the completion of His redemptive mission for humanity. At the top of the Cross, the inscription 'INRI' is displayed, meaning 'Jesus of Nazareth, King of the Jews' in Latin, a declaration of both mockery by His accusers and truth from God. Jesus is the Lamb of God, whose sacrifice redeems mankind from the sins of the world, fulfilling the ancient prophecy of the sacrificial lamb. Additionally, at the foot of the Cross, Mary, His mother, Mary Magdalene, and John, the beloved disciple, witness His suffering. Jesus entrusts Mary his mother to John, saying, 'Woman, here is your son,' and to John, 'Here is your mother.' This act of care symbolizes the creation of a new family of faith. The Roman centurion, Saint Longinus, pierces Jesus' side with a spear, confirming His death. The Crucifixion signifies the ultimate act of love and redemption for humanity’s sins, as Jesus willingly sacrifices Himself for the salvation of all.\n\nĠesu’ Msallab (Il-Vara Il-Kbira) turi l-eżekuzzjoni ta’ Ġesù fil-Golgota. Msallab mas-Salib, Ġesù sofra agunija fiżika u moqrija ta’ dawk li kienu qed jarawh. Minkejja s-sofferenza tiegħu, Ġesù offra maħfra lil dawk li kienu qed jippersegwitawh u mbagħad ta l-Ispirtu Tiegħu lil Alla. L-aħħar kliem Tieghu kienu: 'Missier, aħfrilhom, għax ma jafux x’qed jagħmlu' u 'Kollox mitmum'. Dawn il-kliem jindikaw it-tmien tal-missjoni tiegħu għall-fidwa tal-umanità. Fuq is-salib tidher l-inskrizzjoni bil-kliem 'INRI', li tfisser 'Ġesù ta’ Nazaret, ir-Re’ tal-Lhud' fil-Latin, dikjarazzjoni li kienu għadu jiddiħku bih u kif ukoll verità minn Alla. Ġesù huwa l-Ħaruf t’Alla, li s-sagrifiċċju Tiegħu jifdi lill-umanità mid-dnubiet tad-dinja, u jwettaq il-profezija antika tal-ħaruf tas-sagrifiċċju.Taħt is-Salib kien hemm, Marija, ommu, Marija il-Madalena, u Ġwanni, id-dixxiplu l-maħbub, ukoll xhieda tat-tbatija tiegħu. Kien hawn li Ġesù ta lil-Marija lil-Ġwanni meta qalila 'Omm, hawn ibnek,' u lil-Ġwanni, 'Hawn hi ommok'. Din l-azzjoni ta’ l-għożża tissimbolizza l-ħolqien ta’ familja ġdida tal-fidi. Iċ-ċenturjun Ruman, San Longinu, daħħal il-lanza fil-kustat ta’ Ġesù biex jikkonferma il-mewt tiegħu. Ġesu’ Msallab tissimbolizza l-akbar att ta’ imħabba għall-fidwa tal-bnedmin, hekk kif Ġesù jagħti Lilu nnifsu għall-fidwa tal-oħrajn.",
    "The Ecce Homo": "The ‘Ecce Homo’ moment occurs when Pontius Pilate presents Jesus to the crowd after His scourging, saying, ‘Behold the man!’ (John 19:5). This scene takes place at the Antonia Fortress, the Roman military stronghold in Jerusalem, where Jesus was held and subjected to brutal treatment. Pilate, seeking to absolve himself of responsibility, washes his hands and declares, ‘I am innocent of this man’s blood; see to it yourselves.’ (Matthew 27:24). Jesus stands before the crowd, wearing a crown of thorns, a symbol of mockery and pain, and Pilate presents Him at the Lithostrotos, also known as Gabbatha, a paved area in the fortress, before the people (John 19:13). Pilate, hoping to release Jesus, offers the choice between Jesus and Barabbas, a notorious criminal, saying, ‘Whom do you want me to release for you: Barabbas, or Jesus who is called Christ?’ (Matthew 27:17). But the crowd, incited by the chief priests, shouts, ‘Not this man, but Barabbas!’ (John 18:40). Beforehand, Pilate engages with Jesus in a conversation, asking Him, ‘Are you the King of the Jews?’ (John 18:33). Jesus replies, ‘My kingdom is not of this world. If my kingdom were of this world, my servants would have been fighting, that I might not be delivered over to the Jews. But my kingdom is not from the world.’ (John 18:36). Pilate, intrigued but dismissive, questions, ‘So you are a king?’ To which Jesus responds, ‘You say that I am a king. For this purpose I was born and for this purpose I have come into the world—to bear witness to the truth. Everyone who is of the truth listens to my voice.’ (John 18:37). Pilate, perplexed by this declaration, asks, ‘What is truth?’ (John 18:38). This exchange further underscores Jesus' spiritual kingship and the contrast between His kingdom and earthly power. Despite the injustice, Jesus endures the humiliation with quiet strength, fulfilling the prophecies about the suffering Messiah and showcasing His commitment to His divine mission. His acceptance of this suffering becomes the ultimate act of love and sacrifice for the salvation of humanity.\n\nL-Ecce Homo jissimbolizza l-mument meta Ponzu Pilatu ippreżenta lil Ġesù lill-folla wara li ġie flaġellat, u qal: 'Arawh, hawn hu l-bniedem!' (Ġwanni 19:5) Din ix-xena sseħħ fil-Fortizza ta' Antonia, fil-qasam militari Ruman f'Ġerusalemm, fejn Ġesù kien ġie miżmun u suġġett għat-trattament brutali. Pilatu, fl-isforz tiegħu li ffarfar mir-responsabbiltà, ħasel idejh u qal: 'Jien m’iniex ħati ta’ dan id-demm: dan arawh intom!' (Mattew 27:24) Ġesù qiegħed quddiem il-folla, b’kuruna tax-xewk, simbolu tat-tbatija u żebla ta’ l-poplu, u Pilatu juri lil Ġesù fil-Lithostrotos magħruf wkoll bhala Gabbatha, żona pavimentata fil-fortizza, quddiem il-poplu (Ġwanni 19:5). Pilatu, fl-isforz li jeħles lil Ġesù, joffri l-għażla bejn Ġesù u Barabbas, kriminal magħruf, iżda l-folla tagħżel li jeħilsu lil Barabbas. Qabel, Pilatu jitkellem ma’ Ġesù, u  staqsieh: 'Inti s-sultan tal-Lhud?' (Ġwanni 18:33) Ġesù jwieġeb: Is-saltna tiegħi mhijiex ta’ din id-dinja. Li kieku saltnati kienet ta’ din id-dinja, l-għases tiegħi kienu jiġġieldu biex ma ningħatax f’idejn il-Lhud; imma tabilħaqq saltnati mhijiex ta’ hawn.' (Ġwanni 18:36) Pilatu, kurjuż imma indifferenti, jistaqsi: 'Mela int sultan?' Ġesù jirrispondi: 'nt qiegħed tgħidu; jien sultan. Jien għalhekk twelidt, u għalhekk ġejt fid-dinja, biex nixhed għall-verità. U kull min iħobb il-verità jisma’ leħni.' (Ġwanni 18:37) Pilatu, konfuż, jistaqsi: 'U l-verità x’inhi?' (Ġwanni 18:38) Dan l-iskambju jissottolinea aktar il-qawwa spiritwali ta’ Ġesù u l-kuntrast bejn ir-renju Tiegħu u l-poter tad-dinja. Minkejja l-inġustizzja, Ġesù jsoffri fil-kwiet u hekk isseħħ il- profezija ta’ il-Messija li jbati, filwaqt li juri l-impenn lejn il-missjoni divina Tiegħu. Is-sofferenza Tiegħu turi l-akbar att ta’ imħabba u sagrifiċċju għall-fidwa tal-umanità.",
    "The Flogged": "The 'Flogged' refers to the brutal scourging of Jesus before His crucifixion. Jesus was flogged by Roman soldiers using a whip with pieces of bone and metal, tearing His flesh and leaving Him covered in deep wounds. The number of lashes Jesus endured is often considered symbolic of the extent of His suffering. He received forty lashes minus one, as Roman law dictated that thirty-nine lashes were the maximum permissible. This act of violence was not only physically excruciating but also deeply humiliating. Despite the immense pain, Jesus did not resist or cry out. His willingness to endure this suffering serves as a profound demonstration of His love for humanity and His determination to fulfill His mission of redemption. This moment highlights Jesus' submission to God's will and His commitment to the salvation of sinners, showing the depths of His sacrifice for the forgiveness of sins.\n\nIl-Marbut jirrapreżenta s-swat brutali ta’ Ġesù qabel il-kruċifissjoni tiegħu. Ġesù ġie flaġellatt mill-suldati Rumani bi frosta li kien fiha biċċiet ta’ l-għadam  u metal, li kien iħalli feriti profondi. L-għadd ta' daqqiet bil-frosta li Ġesù sofra ħafna drabi huma simboliku tat-tbatija Tiegħu. Huwa rċieva wieħed inqas minn erbghin daqqa bil-frosta, peress li l-liġi Ruma kienet stabbilit li tletin u disgħa kienu l-massimu permessibbli ta’ daqqiet. Dan l-att ta’ vjolenza kien mhux biss doloruż fiżikament, iżda wkoll umiljanti. Minkejja l-uġigħ kbir, Ġesù qatt ma jgħajjat jew irreżista. Il-volontà Tiegħu li jsofri din it-tbatija hija dimostrazzjoni profonda tal-imħabba Tiegħu għall-umanità u l-impenn Tiegħu li jwettaq il-missjoni Tiegħu tas-salvazzjoni.  Dan il-mument jirrifletti s-sottomissjoni ta’ Ġesù għall-volontà ta’ Alla u l-impenn tiegħu għas-salvazzjoni tal-bnedmin. Juri ukoll kemm kien kbir is-sagrificcju Tiegħu għall-maħfra tad-dnubiet.",
    "The Lady of Sorrows": "The 'Lady of Sorrows' focuses on Mary, the mother of Jesus, and her deep suffering during His Passion and death. As she witnesses her Son's agony, her grief becomes symbolic of the pain that accompanies love and faith in the face of immense sorrow. In art, this sorrow is often depicted with seven symbolic swords piercing her heart, representing the major sorrows she endured, including the prophecy of Simeon, the flight to Egypt, the loss of Jesus in the Temple, and the crucifixion. Some depictions of Mary in her sorrow show a blade in her chest, representing the intensity of her pain. In these artistic representations, Saint John the Apostle, Jesus' beloved disciple, is often portrayed at her side, embodying his role as her son after Jesus' crucifixion, as Jesus entrusted her to him. In certain portrayals, an angel is shown comforting Mary, or she is depicted holding the lifeless body of her Son, further emphasizing her sorrowful devotion to Christ. Mary's unwavering faith and love, despite the heartbreaking events she endures, make her a model of compassion, endurance, and hope for all believers.\n\nId-Duluri tenfasizza l-istorja ta’ Marija, omm Ġesù, u s-sofferenza profonda tagħha waqt il-Passjoni u l-mewt ta’ Ġesù. Waqt li hija ghexet l-agunija ta’ binha, n-niket tagħha jissimbolizza l-uġigħ li jakkumpanja l-imħabba u l-fidi, f’ mumenti ta’ tbatija kbira. Fl-arti, din is-sofferenza hija spiss irrappreżentata b’ sebgha xwabel jinfdnulha qalbha, rappreżentattivi tat-tbatijiet prinċipali li hija għaddiet minhom, l-profezija ta’ Simjun, il-ħarba lejn l-Eġittu, it-telfa ta’ Ġesù fil-Tempju, u l-kruċifissjoni. F’xi rappreżentazzjonijiet oħra tad-duluri juru il-Madonna b’sejf jinfdilha qalbha, li jirrappreżenta l-intensità ta’ l-uġigħ tagħha. F’dawn l-immaġini artistiċi, San Ġwann l-Appostlu, id-dixxiplu l-għażiż ta’ Ġesù, ħafna drabi jidher ma’ ġenbha, u dan juri r-rwol tiegħu bħala l-iben tagħha wara l-kruċifissjoni ta’ Ġesù, peress li Ġesù fdalu lilha.Statwi oħra juru anġlu li qed jidher jagħti wens lil Marija, jew hi qed iżżomm f dirgħejjha l-ġisem mingħajr ħajja ta’ binha. Hawn jidher, id-dedikazzjoni għall-Kristu. Il-fidi u l-imħabba qawwija ta’ Marija, minkejja l-avvenimenti dolorużi li għaddejja minnhom, hija mudell ta’ kompassjoni, sofferenza u tama għall-fidili kollha.",
    "The Last Supper": "The 'Last Supper' depicts Jesus' final meal with His disciples before His arrest, a moment of profound significance in Christian tradition. During the meal, He institutes the Eucharist, offering bread and wine as His body and blood, which He commands His followers to partake in 'in remembrance of Me' (Luke 22:19). This act of sharing bread and wine establishes the foundation of Christian worship and communion. Jesus also washes the feet of His disciples, a symbolic act of humility and service, teaching them to love and serve one another as He has done for them. As He predicts His betrayal, Peter, deeply distressed, declares that he will never deny Jesus, but Jesus forewarns him that before the rooster crows, he will deny Him three times. The Last Supper thus marks both an intimate moment of fellowship and the institution of the Eucharist, signifying Jesus’ love, sacrifice, and the establishment of a new covenant between God and humanity through His body and blood. Jesus further affirms the new covenant with His words, 'This is the new covenant in My blood, which is poured out for you' (Luke 22:20). He explains that His sacrifice is a fulfillment of the prophecies, and the bread and wine symbolize His body and blood given for the salvation of humanity. This marks the beginning of the central Christian sacrament, which Christians continue to observe as a sign of unity with Christ and one another.\n\nL-Aħħar Ċena tirrakkonta l-aħħar l-ikla ta’ Ġesù Kristu mad-dixxipli tiegħu qabel l-arrest u l-passjoni tiegħu, mument ta’ sinifikat profond fil-tradizzjoni Kristjana. Matul l-ikla, Ġesù jwaqqaf l-Ewkaristija, fejn joffri ħobż u inbid bħala ġismu u demmu, u jikkmanda lid-dixxipli biex jaghmlu dan  'b’tifkira tiegħi'; ‘Imbagħad ħa l-ħobż, radd il-ħajr, qasmu, newwilhulhom u qal: ‘Dan hu ġismi li jingħata għalikom; agħmlu dan b’tifkira tiegħi.’ (Luqa 22:19). Dan l-att ta’ qsim ta’ ħobż u inbid jistabbilixxi l-bażi tal-fidi, tat-tqarbin, u twemmin Kristjan. Ġesù wkoll jaħsel saqajn id-dixxipli tiegħu, att simboliku ta’ umiltà u servizz, biex jagħthi lezzjoni fuq kif għandna inhobbu u nqimu lil xulxin, hekk kif għamel hu. Fl-aħħar ċena, Ġesù jħabbar kif se jiġi tradut, Pietru, li jiġi diżappuntat ħafna, jgħid li qatt ma jiċħad lil Ġesù, iżda Ġesù jħabbar li qabel ma jdoqq is-serduk, Pietru se jiċħdu tliet darbiet. Ġesù jkompli jikkonferma l-patt il-ġdid bil-kliem tiegħu, 'Hekk ukoll wara l-ikla ħa l-kalċi u qal: “Dan il-kalċi huwa l-Patt il-Ġdid b’demmi, id-demm li jixxerred għalikom.' (Luqa 22:20). Huwa jispjega li s-sagrifiċċju tiegħu huwa t-twettiq tal-profeziji, u l-ħobż u l-inbid jissimbolizzaw il-ġisem u d-demm tiegħu mogħtija għall-fidwa tal-umanità. Dan jifforma l-bidu tas-sagrament ċentrali tal-Kristjaneżmu tat-tqarbin, li l-Kristjani jkunu jistgħu jirċievu lil-Kristu bħala sinjal ta’ unità ma’ Kristu u ma’ xulxin. L-Aħħar Ċena għalhekk tissimbolizza mument intimu ta’ ħbiberija u t-twaqqif tal-Ewkaristija, li jirrappreżenta l-imħabba ta’ Ġesù, is-sagrifiċċju tiegħu, u t-twaqqif tal-patt il-ġdid bejn Alla u l-umanità permezz ta’ ġisem u demm Kristu.",
    "The Monument": "The 'Monument' refers to the solemn tomb where Jesus' body was laid after His crucifixion. After His death, Jesus' body was taken down from the cross and placed in a tomb donated by Joseph of Arimathea, a wealthy and respected member of the Jewish council who secretly followed Jesus. He requested permission from Pilate to take Jesus’ body and give it a proper burial, fulfilling the prophecy that the Messiah would be buried in a rich man’s tomb. The tomb was sealed with a large stone, and guards were placed to ensure that no one could steal the body. The 'Monument' signifies not only the end of Jesus’ earthly mission but also the period of waiting before His glorious resurrection. It becomes a symbol of hope, as Christians believe that from death comes new life, and it represents the triumph of Jesus over death and sin. In addition, the Shroud of Turin, believed by many to be the burial cloth of Jesus, holds the image of His body, believed to be imprinted by miraculous means, and serves as a powerful symbol of His death, resurrection, and enduring legacy.\n\nIl-Monument jirreferi għall-qabar solenni fejn tqiegħed il-ġisem ta’ Ġesù wara l-kruċifissjoni tiegħu. Wara l-mewt tiegħu, ġismu ġie meħud mis-salib u tqiegħed f’qabar ġdied minn Ġużeppi minn Arimatija, raġel sinjur u rispettat, kif wkoll membru tal-kunsill Lhud li bil-moħbi kien jemmen dak li kien jghid Ġesù. Huwa talab lill-Ponzu Pilatu permess biex jieħu ġismu ta’ Ġesù u jagħtih difna xierqa, u b’dan iwettaq il-professija Messanikja, fejn tgħid li l-Messija jiġi midfun f’qabar ta’ sinjur. Il-qabar ġie sigillat b’ġebla kbira, u s-suldati gwardji ġew stabbiliti biex jiżguraw li ħadd ma seta’ jieħu l-ġisem. Il-Monument jissimbolizza mhux biss tmiem il-missjoni ta’ Ġesù fid-dinja, iżda wkoll il-perjodu ta’ stennija qabel il-qawmien mill-imwiet tiegħu. Għalhekk, il-monument isir simbolu ta’ tama għall-Kristjani li jemmnu li mill-mewt tiġi ħajja ġdida, u jirrappreżenta r-rebħa ta’ Ġesù fuq il-mewt u d-dnub. Barra minn hekk, il-Liżar ta’ Kristu, li ħafna jemmnu li hija l-liżar li gie midfun bih Ġesù, iżżomm il-marki tal-ġisem tiegħu, li ħafna jemmnu li ġiet markat b’mod mirakoluż, u huwa simbolu tal-qawmien mill-imwiet, u l-wirt etern ta’ Ġesù Kristu.",
    "The Redeemer": "The 'Redeemer' emphasizes Jesus as the Savior who reconciles or redeemes humanity with God through His sacrifice. His death and resurrection embody love, mercy, and victory over sin. The Redeemer is the cornerstone of Christian faith, offering eternal life to all who believe in Him. Jesus’ sacrifice opened the path to salvation, demonstrating God’s deep love for humanity. Carrying the heavy cross, which weighed over 300 pounds, He endured immense physical pain and fell three times on His way to Golgotha, symbolizing His suffering and determination to fulfill God’s redemptive plan. The cross, once a symbol of death, became the ultimate instrument of salvation through Jesus’ sacrifice, marking His victory over sin and death and offering eternal life to believers.\n\nIr-Redentur juri lil Ġesù bħala s-Salvatur li jirrikonċilja jew jifdi l-umanità ma’ Alla permezz tas-sagrifiċċju tiegħu. Il-mewt u l-qawmien mill-imwiet tiegħu juru l-imħabba, il-ħniena, u r-rebħa fuq id-dnub. Ir-Redentur iservi bħala l-pedament tal-fidi Nisranija, simbolu ta’ ħajja eterna lil dawk kollha li jemmnu fih. Is-sagrifiċċju ta’ Ġesù fetaħ it-triq għall-fidwa u wera l-imħabba divina ta’ Alla għall-umanità. Ġesù, li jġorr is-salib it-tqil, li kien jiswa aktar minn 300 lira, sofra ħafna u waqqa’ tliet darbiet fit-triq lejn il-Kalvarju, jissimbolizza l-isforz u s-sofferenza tiegħu, iżda mbagħad ried li jwettaq il-pjan ta’ Alla. Is-salib, simbolu ta’ mewt, sar l-aktar strument ta’ salvazzjoni permezz tas-sagrifiċċju ta’ Ġesù, ir-rebħa tiegħu fuq id-dnub u l-mewt, kif wkoll simbolu tal-ħajja eterna lill-dawk li jemmnu.",
    "The Veronica": "The story of 'Veronica', recounts how a woman named Veronica who compassionately wiped Jesus’ face with a cloth during His journey to Calvary. As she offered this simple act of kindness, the cloth miraculously retained an imprint of His face, symbolising divine grace. This moment, often depicted in religious art, highlights her courage and faith in the midst of suffering. Veronica’s act represents compassion, empathy, and the power of faith, reminding Christians of their duty to show love and mercy to others, especially in times of pain and hardship. Her story inspires believers to be witnesses of Christ’s suffering and to act with selfless love in the face of adversity.\n\nL-istorja tal-Veronika tirrakkonta kif mara msejħa Veronika li b’kompassjoni mesħet wiċċ Ġesù Kristu b’biċċa drapp waqt il-vjaġġ tiegħu lejn il-Kalvarju. Waqt li offrret dan l-att sempliċi ta’ ħniena, il-drapp mirakolużament żamm l-forma ta’ wiċċ Ġesù, att li jissimbolizza l-grazzja divina. Dan il-mument wkoll, spiss irrappreżentat fl-arti reliġjuża, juri l-kuraġġ u l-fidi tagħha fit-tbatija u sofferenza. L-att ta’ Veronika jirrappreżenta kompassjoni, empatija, u l-qawwa tal-fidi, u jfakkar lill-Kristjani fil-bżonn li juru imħabba u ħniena lejn oħrajn, speċjalment f’żminijiet ta’ uġigħ u tbatija. L-istorja tagħha tispira lill-dawk li jemmnu biex ikunu xhieda tas-sofferenza ta’ Kristu u jaġixxu b’imħabba mingħajr egoiżmu quddiem l-avversità."
}